src/Catalogs/KFK_Продюсеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>KFK_Продюсеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогЛогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПродюсера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Топики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Брокер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KFK_Брокеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Топик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/KFK_Продюсеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция СписокТопиковБрокера(Брокер) 
	
	СписокТопиков = Новый СписокЗначений;
	
	ДополнительныеПараметры = Новый Структура("ПараметрыПодключения", Новый Соответствие);
	
	Для каждого Параметр Из Брокер.ПараметрыПодключения Цикл
		ДополнительныеПараметры.ПараметрыПодключения.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ДанныеТопиков = KFK_Интеграция.ПолучитьДанныеТопиковБрокера(Брокер.АдресБрокера, ДополнительныеПараметры); 
	
	Для каждого СтрокаТопика Из ДанныеТопиков Цикл
		СписокТопиков.Добавить(СтрокаТопика.Топик, СтрокаТопика.Топик);	
	КонецЦикла;
	
	Возврат СписокТопиков;
	
КонецФункции

&НаКлиенте
Процедура ТопикиБрокерПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.Топики.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;     
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Брокер) Тогда
		Возврат;	
	КонецЕсли;
	
	СписокТопиков = СписокТопиковБрокера(ТекущиеДанные.Брокер);      
	Элементы.Топики.ПодчиненныеЭлементы.ТопикиТопик.СписокВыбора.ЗагрузитьЗначения(СписокТопиков.ВыгрузитьЗначения());  
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)                             
	// TODO: нужно актуализировать списки топиков для конкретного брокера, указанного в строке

КонецПроцедуры
